# MaxSegmentAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Sweep..::..MaxSegmentAngle Property
Sweep Class See Also
---
The maximum segment angle of the sweep in radians.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double MaxSegmentAngle { get; set; }
```

Visual Basic
---
```text
Public Property MaxSegmentAngle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MaxSegmentAngle {
	double get ();
	void set (double value);
}
```

# Remarks
This property is used to retrieve/set the maximum segment angle of the sweep. It is settable only when the trajectory segmentation is enabled.
# See Also
Sweep Class
Autodesk.Revit.DB Namespace